//3. Создайте строку и используйте цикл для вывода каждого символа строки на новой строке.

string str = "Hello, world!";

for (int i = 0; i < str.Length; i++)
{
    Console.WriteLine(str[i]);
}